Revit 2027 API
BoxPlacement Enumeration
 An enumerated type containing possible constraint types for Adaptive Points.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum BoxPlacement
Public Enumeration BoxPlacement
public enum class BoxPlacement
type BoxPlacement
Members
Member name | Value | Description
BottomLeft | 4 |  Placement of a box by its bottom left corner.
BottomRight | 3 |  Placement of a box by its bottom right corner.
Center | 0 |  Placement of a box by its center point
TopLeft | 1 |  Placement of a box by its top left corner.
TopRight | 2 |  Placement of a box by its top right corner.
See Also
Reference
Autodesk.Revit.DB Namespace